class txt(object):
    STAT = """<b>ʜᴇʟʟᴏ {} 👋🏻

ɪ ᴀᴍ ᴍᴜʟᴛɪ ᴛᴀsᴋɪɴɢ ʙᴏᴛ ᴡɪᴛʜ ᴍᴀɴʏ ᴜsᴇғᴜʟʟ ғᴇᴀᴛᴜʀᴇs. 

ᴄʜᴇᴄᴋ ʜᴇʟᴘ ᴍᴇɴᴜ ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ 🗞️

ᴇx » ᴛᴇʟᴇɢʀᴀᴘʜ, ᴀɪ ᴀɴᴅ ᴇᴛᴄ...</b>
 """

    ABT = """ 
<b>╔════❰ ᴍᴜʟᴛɪ ᴛᴀsᴋɪɴɢ ᴘʀᴏ ❱═❍
║╭━━━━━━━━━━━━━━━➣
║┣⪼🤖ᴍʏ ɴᴀᴍᴇ : {bot}
║┣⪼👦ᴅᴇᴠᴇʟᴏᴘᴇʀ : <a href='https://t.me/silicon_admin_bot'>sɪʟɪᴄᴏɴ ᴅᴇᴠᴇʟoᴘᴇʀ ⚠️</a>
║┣⪼❣️ᴜᴘᴅᴀᴛᴇ : <a href=https://t.me/Silicon_Bot_Update>sɪʟɪᴄᴏɴ ʙᴏᴛᴢ</a>
║┣⪼🗣️ʟᴀɴɢᴜᴀɢᴇ : <a href=https://www.python.org>ᴘʏᴛʜᴏɴ 3</a>
║┣⪼📚ʟɪʙʀᴀʀʏ : <a href=https://github.com/pyrogram>ᴘʏʀᴏɢʀᴀᴍ</a> 
║┣⪼🗒️ᴠᴇʀsɪᴏɴ : ᴍᴜʟᴛɪ ᴛᴀsᴋɪɴɢ v2.01.1
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍ </b>"""


    HELP = """<b>𝙷𝙴𝚁𝙴 𝙸𝚂 𝙼𝚈 𝙷𝙴𝙻𝙿 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂.

𝚅𝙸𝚂𝙸𝚃 𝙼𝚈 𝚂𝙴𝙲𝙾𝙽𝙳 & 𝚃𝙷𝙸𝚁𝙳 𝙿𝙰𝙶𝙴 𝙵𝙾𝚁 𝙼𝙾𝚁𝙴 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂</b> 😎"""

    AI_TXT = """<b>ɴᴏᴡ sᴇʟғ ᴘʀᴏᴍᴘᴛ ᴀɪ ᴏғ ᴄʟᴏᴜᴅ sᴏɴɪᴄ 𝟹.𝟻 ᴡɪᴛʜ ɢʀᴇᴀᴛ ᴘᴏᴡᴇʀs ʏᴏᴜ ᴄᴀɴ ᴜsᴇ 

/ai {ǫᴜᴇʀʏ}</b>"""

    HELP_NXXT = """<b>𝙷𝙴𝚁𝙴 𝙸𝚂 𝙼𝚈 𝚃𝙷𝙸𝚁𝙳 𝙿𝙰𝙶𝙴</b>"""

    BIN_GEN = """ɢᴇɴᴇʀᴀᴛᴇ ʀᴀɴᴅᴏᴍ ᴄʀᴇᴅɪᴛ ғʀᴏᴍ ᴛʜᴇ ɢɪᴠᴇɴ 6 ᴅɪɢɪᴛ ʙɪɴ.

/gen xxxxxx 

𝖭𝗈𝗍𝖾 :- 𝖴𝗌𝖾 𝗍𝗁𝗂𝗌 𝖥𝗈𝗋 𝖥𝗎𝗇 𝖯𝗎𝗋𝗉𝗈𝗌𝖾 😀"""

    IMAGINE = """<b>ɴᴏᴡ ɪᴍᴀɢɪɴᴇ ʏᴏᴜʀ ᴠɪsᴏɴ ᴘᴏᴡᴇʀ ɪɴᴛᴏ ʀᴇᴀʟɪᴛʏ...

/imagine Cat"""

    CHAT_GPT = """<b>𝙰𝙺𝚂 𝚀𝚄𝙴𝚂𝚃𝙸𝙾𝙽 𝚆𝙸𝚃𝙷  𝙲𝙷𝙰𝚃 𝙶𝙿𝚃 🎭

ᴜsᴇ /ask coᴍᴍᴀɴᴅ ᴡɪᴛʜ ʏᴏᴜʀ ǫᴜᴇsᴛɪᴏɴ    
</b>"""

    BARD = """<b>𝙱𝙰𝚁𝙳 𝙰𝙸 😅
    
 ᴜsᴇ /bard ᴛᴏ ᴀsᴋ ǫᴜᴇsᴛɪᴏɴ ᴡɪᴛʜ ʙᴀʀᴅ ᴀɪ</b>"""

    INSTA = """<b>ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ᴅᴏᴡɴʟᴏᴀᴅ ɪɴsᴛᴀ ᴠɪᴅᴇᴏs 🥳

ᴜsᴇ - /insta {ᴠɪᴅᴇᴏ_ᴜʀʟ}</b>"""

    TELEGRAPH = """<b>ᴄᴜʀʀᴇɴᴛʟʏ ɪ ʜᴀᴠᴇ ᴛᴡᴏ ᴍᴇᴛʜᴏᴅ 😎
    
𝚒» ᴜsᴇ /upload ᴛᴏ ᴜᴘʟᴏᴀᴅ ɪᴍᴀɢᴇs ᴏɴ ᴇɴᴠs.sʜ

𝚒𝚒»ᴜsᴇ /imgbb ᴛᴏ ᴜᴘʟᴏᴀᴅ ɪᴍᴀɢᴇs ᴏɴ ɪ.ɪʙʙ.ᴄᴏ </b>"""

    GEN_VIDEO = """<b>𝙲𝙾𝙽𝚅𝙴𝚁𝚃 𝚃𝙴𝚇𝚃 𝙸𝙽𝚃𝙾 𝚅𝙸𝙳𝙴𝙾 🤯

ᴜsᴇ /genvid ᴡɪᴛʜ ʏᴏᴜʀ ᴘʀᴏᴍᴘᴛ ᴛᴏ ɢᴇɴᴇʀᴀᴛᴇ ᴠɪᴅᴇᴏ</b>"""

    SCAN_PH = """<b>sᴄᴀɴ ᴘʜᴏᴛᴏ ᴀɴᴅ sᴏʟᴠᴇ ᴇʀʀᴏʀ ✓

ᴜsᴇ /scan_ph ᴄᴏᴍᴍᴀᴍᴅ
</b>"""

    QR_CODE = """ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ᴄᴏɴᴠᴇʀᴛ ᴛᴇxᴛ ᴛᴏ ǫʀ ⚡ 

ᴜsᴇ /qr """

    SONG_TXT = """ʏᴏᴜ ᴄᴀɴ ᴅᴏᴡɴʟᴏᴀᴅ sᴏɴɢ ʙʏ ᴜsɪɴɢ 

/sᴏng {name}"""

    NEWS_TXT = """ɢᴇᴛ ʟᴀᴛᴇsᴛ ɴᴇᴡs ᴀʙᴏᴜᴛ ᴛʜᴇ ᴛᴏᴘɪᴄ 

/news {topic}"""

    REPO = """sᴇᴀʀᴄʜ ʀᴇᴘᴏ ᴏɴ ᴛᴇʟᴇɢʀᴀᴍ

ᴜsᴇ : /repo {name}"""

    JSON = """ɢᴇᴛ ᴊsᴏɴ ᴏғ ᴀɴʏ ᴍᴇssᴀɢᴇ

ᴜsᴇ : /json"""

    LYRICS = """ɢᴇᴛ ʟʏʀɪᴄs ᴏғ ᴀɴʏ sᴏɴɢ 😀

ᴜsᴇ : /lyrics"""

    PASSWORD = """ɢᴇɴᴇʀᴀᴛᴇ ᴘᴀssᴡᴏʀᴅ ʀᴀɴᴅᴏᴍʟʏ

ᴜsᴇ : /password {no. of digit}"""

    

    SHARE_TXT = """sʜᴀʀᴇ ᴛʜᴇ ᴀs ʟᴏɴɢ ᴛᴇxᴛ ᴛʜʀᴏᴜɢʜ ʙᴜᴛᴛᴏɴ...

/share Silicon Botz"""

    HELP_NXT = """𝚃𝙷𝙸𝚂 𝙸𝚂 𝙼𝚈 𝚂𝙴𝙲𝙾𝙽𝙳 𝙿𝙰𝙶𝙴 🎃"""


    MONGO = """<b>ʏᴏᴜ ᴀʀᴇ ɴᴏᴡ ᴀʙʟᴇ ᴛᴏ ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴍᴏɴɢᴏ ᴅʙ ᴜʀʟ ɪs ᴠᴀʟɪᴅ ᴏʀ ɴᴏᴛ 

ᴜsᴇ /mongo 𝚢𝚘𝚞𝚛_𝚞𝚛𝚕</b>"""

    BLACK_BOX ="""<b>ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ʙʟᴀᴄᴋ ʙᴏx ᴀɪ ᴏɴ ᴛᴇʟᴇɢʀᴀᴍ 🤓

/blackbox query</b>"""

    INFO = """◉ ᴊᴜsᴛ sᴇɴᴅ /id ᴏʀ /info ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴛɢ ɪᴅ ᴏʀ ɪɴғᴏ 🍁

◉ /id ᴏʀ /info - ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇᴅɪᴀ ᴛᴏ ɢᴇᴛ ɪᴛs ɪᴅ

◉ sᴇɴᴅ ᴄʜᴀɴɴᴇʟ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ғᴏʀᴡᴀʀᴅ ᴛᴀɢ ᴛᴏ ɢᴇᴛs ɪᴛs ɪᴅ 

/id & /info  ᴛʜᴇsᴇ ᴛᴡᴏ ᴄᴏᴍᴍᴀɴᴅ ᴀʀᴇ sᴀᴍᴇ 😉
ᴍᴇᴅɪᴀ = [ᴘʜᴏᴛᴏ, ᴠɪᴅᴇᴏ, ᴀᴜᴅɪᴏ, ᴅᴏᴄᴜᴍᴇɴᴛs, sᴛɪᴄᴋᴇʀ]"""
   
    FUN = """<b><u>ᴊᴜsᴛ ᴛᴇsᴛ ᴛʜᴇsᴇ ᴄᴏᴍᴍᴀɴᴅ 😉</u></b>

◉ /runs         
◉ /ikka      
◉ /dice     
◉ /arrow    
◉ /goal    
◉ /luck    
◉ /throw     
◉ /bowling  
◉ /tenpins  """
   
    CHANNEL_ID = "--"

    TELE = """<b>ᴡᴀʟʟᴘᴀᴘᴇʀ</b>

ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ɢᴇɴʀᴀᴛᴇ ᴡᴀʟʟ ᴘᴀᴘᴇʀ..

</b>ᴜsᴀɢᴇ:</b>
◉ /wall Silicon """

    PASTE = """ʜᴇʟᴘ: <b>ᴘᴀsᴛᴇ</b>

ᴘᴀsᴛᴇ sᴏᴍᴇ ᴛᴇxᴛ ᴏʀ ᴅᴏᴄᴜᴍᴇɴᴛs ᴏɴ ᴡᴇʙsɪᴛᴇ ‼️

<b>ᴄᴏᴍᴍᴀɴᴅ ᴀɴᴅ ᴜsᴀɢᴇ :</b>
• /paste - ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍᴇssɢᴀᴇ ᴡɪᴛʜ ᴘᴀsᴛᴇ """

    IMAGE = """➤ ʜᴇʟᴘ: ɪᴍᴀɢᴇ

ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ʜᴇʟᴘs ʏᴏᴜ ᴛᴏ ᴇᴅɪᴛ ɪᴍᴀɢᴇ ᴠᴇʀʏ ᴇᴀsɪʟʏ

➤ : <b>ᴄᴏᴍᴍᴀɴᴅ ᴀɴᴅ ᴜsᴀɢᴇ </b>
➪ ᴊᴜsᴛ sᴇɴᴛ ᴍᴇ ɪᴍᴀɢᴇ ᴛᴏ ᴇᴅɪᴛ✨ """
  
    STICKER = """ <b>• ᴜsᴀɢᴇ</b>

ᴄᴏɴᴠᴇʀᴛ sᴛɪᴄᴋᴇʀ ᴛᴏ ᴘʜᴏᴛᴏ & ᴄʀᴇᴀᴛᴇ sᴛɪᴄᴋᴇʀ ᴘᴀᴄᴋ & ғɪɴᴅ sᴛɪᴄᴋᴇʀ ɪᴅ.....

⭕ 𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚

◉ /s2_photo - ʀᴇᴘʟʏ ᴡɪᴛʜ ᴀɴʏ sᴛɪᴄᴋᴇʀ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ ɪᴛ ɪɴᴛᴏ ᴘʜᴏᴛᴏ. 
◉ /kang - ʀᴇᴘʟʏ ᴛᴏ sᴛɪᴄᴋᴇʀ ᴏʀ ᴘɴɢ ғɪʟᴇ ᴛᴏ ᴘᴀᴄᴋ sᴛɪᴄᴋᴇʀ.
◉ /id or /info - ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ sᴛɪᴄᴋᴇʀ ᴏʀ ᴍᴇᴅɪᴀ ᴛᴏ ɢᴇᴛ ɪᴛs ɪᴅ."""
   
    CARB_TXT = """🄷🄴🄻🄿 🄵🄾🅁 🄲🄰🅁🄱🄾🄽

𝙲𝙰𝚁𝙱𝙾𝙽 𝙸𝚂 𝙰 𝙵𝙴𝚄𝚃𝚄𝚁𝙴 𝚃𝙾 𝙼𝙰𝙺𝙴 𝚃𝙷𝙴 𝙸𝙼𝙰𝙶𝙴 𝙰𝚂 𝚂𝙷𝙾𝚆𝙽 𝙸𝙽 𝚃𝙷𝙴 𝚃𝙾𝙿 𝚆𝙸𝚃𝙷 𝚈𝙾𝚄𝚁 𝚃𝙴𝚇𝚃𝚂.

𝙵𝙾𝚁 𝚄𝚂𝙸𝙽𝙶 𝚃𝙷𝙴 𝙼𝙾𝙳𝚄𝙻𝙴 𝙹𝚄𝚂𝚃 𝚂𝙴𝙽𝙳 𝚃𝙷𝙴 𝚃𝙴𝚇𝚃 𝙰𝙽𝙳 𝚁𝙴𝙿𝙻𝚈 𝚃𝙾 𝙸𝚃 𝚆𝙸𝚃𝙷 /carbon 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝚃𝙷𝙴 𝙱𝙾𝚃 𝚆𝙸𝙻𝙻 𝚁𝙴𝙿𝙻𝚈 𝚆𝙸𝚃𝙷 𝚃𝙷𝙴 𝙲𝙰𝚁𝙱𝙾𝙽 𝙸𝙼𝙰𝙶𝙴                       

◉ /carbon - ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ """

    LOGO = """ᴛᴏ cʀᴇᴀᴛᴇ ᴡᴀʟʟ ᴘᴀᴘᴇʀ - /wall ʏᴏᴜʀ ɴᴀᴍᴇ

𝖤𝗑𝖺𝗆𝗉𝗅𝖾

/wall 𝖲𝗂𝗅𝗂𝖼𝗈𝗇 """

    YTDL = """<b>𝚈𝙾𝚄𝚃𝚄𝙱𝙴 𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳 𝙼𝙾𝙳𝚄𝙻𝙴</b>

🍁 𝘜𝘴𝘢𝘨𝘦

𝘠𝘰𝘶 𝘊𝘢𝘯 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘈𝘯𝘺 𝘝𝘪𝘥𝘦𝘰 𝘖𝘳 𝘈𝘶𝘥𝘪𝘰 𝘍𝘳𝘰𝘮 𝘠𝘰𝘶𝘵𝘶𝘣𝘦

𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚

• /song 𝚂𝙾𝙽𝙶 𝙽𝙰𝙼𝙴 
• /video or /mp4 𝘈𝘯𝘥 https://youtu.be/*****
• 𝘌𝘹𝘢𝘮𝘱𝘭𝘦:
<code>/song siya ram</code>
<code>/mp4 https://youtu.be/*******</code>
<code>/video https://youtu.be/*****</code>  """
  
    FONT = """🄷🄴🄻🄿 🄵🄾🅁 🄵🄾🄽🅃🅂


𝙵𝙾𝙽𝚃 𝙸𝚂 𝙰 𝙼𝙾𝙳𝚄𝙻𝙴 𝙵𝙾𝚁 𝙼𝙰𝙺𝙴 𝚈𝙾𝚄𝚁 𝚃𝙴𝚇𝚃 𝚂𝚃𝚈𝙻𝙸𝚂𝙷.
𝙵𝙾𝚁 𝚄𝚂𝙴 𝚃𝙷𝙰𝚃 𝙵𝙴𝚄𝚃𝚄𝚁𝙴 𝚃𝚈𝙿𝙴 /font <your text> 𝚃𝙷𝙴𝙽 𝚈𝙾𝚄𝚁 𝚃𝙴𝚇𝚃 𝙸𝚂 𝚁𝙴𝙰𝙳𝚈."""
 
    TTS = """ʜᴇʟᴘ : <b> ᴛᴛs 🎤 ᴍᴏᴅᴜʟᴇ :</b>

ᴄᴏɴᴠᴇʀᴛ ᴛᴇxᴛ ᴛᴏ sᴘᴇᴇᴄʜ

<b>ᴄᴏᴍᴍᴀɴᴅ ᴀɴᴅ ᴜsᴀɢᴇ</b>

• /tts <text> : ᴄᴏɴᴠᴇʀᴛ ᴛᴇxᴛ ᴛᴏ sᴘᴇᴇᴄʜ

<b>NOTE:</b>
• ᴛʜᴇsᴇ ᴄᴏᴍᴍᴀɴᴅ ᴡᴏʀᴋ ᴏɴ ʙᴏᴛʜ ᴘᴍ ᴀɴᴅ ɢʀᴏᴜᴘ
• ᴛʜᴜs ᴄᴀɴ ᴛʀᴀɴsʟᴀᴛᴇ ᴛᴇxᴛ ᴛᴏ 200+ ʟᴀɴɢᴜᴀɢᴇs ɪɴ ᴇɴɢʟɪsʜ"""

    SOURCE = """<b>ᴄᴜʀʀᴇɴᴛʟʏ ᴛʜᴜs ᴘʀᴏᴊᴇᴄᴛ ɪs ᴜɴᴅᴇʀ ᴄᴏɴsᴛʀᴜᴄᴛɪᴏɴ ɪ ᴡɪʟʟ ᴄᴏᴍᴘʟᴇᴛᴇ ɪᴛ sᴏᴏɴ ᴀɴᴅ ғᴏʀ ʀᴇᴘᴏsɪᴛᴏʀʏ ᴜᴘᴅᴀᴛᴇ ᴊᴏɪɴ <a href=https://t.me/Silicon_Bot_Update>sɪʟɪᴄᴏɴ ʙᴏᴛᴢ</a>ᴏᴜʀ ᴜᴘᴅᴀᴛᴇ ᴄʜᴀɴɴᴇʟ</b> """

    INFO_TXT = """<b>
<u>👁️‍🗨️ ʏᴏᴜʀ ᴅᴇᴛᴀɪʟs</u>

○ ɪᴅ : <code>{id}</code>
○ ᴅᴄ : <code>{dc}</code>
○ ғɪʀsᴛ ɴᴀᴍᴇ : <code>{n}<code>
○ ᴜsᴇʀ ɴᴀᴍᴇ : @{u}
○ ʟɪɴᴋ : <code>https://t.me/{u}</code>

𝑇ℎ𝑎𝑛𝑘𝑠 𝑓𝑜𝑟 𝑢𝑠𝑖𝑛𝑔 𝑚𝑒 𝑠ℎ𝑎𝑟𝑒 𝑚𝑒 𝑤𝑖𝑡ℎ 𝑦𝑜𝑢𝑟 𝑓𝑟𝑖𝑒𝑛𝑑 𝑎𝑛𝑑 𝑏𝑒𝑐𝑜𝑚𝑒 𝑐𝑜𝑜𝑙 ❣️</b>"""

